
export interface PackageOption {
    name: string;
    price: string;
}

export interface PackageCategory {
    id: string;
    title: string;
    icon: 'facebook' | 'instagram' | 'tiktok';
    subPackages: {
        title: string;
        note?: string;
        options: PackageOption[];
    }[];
}

export const packages: PackageCategory[] = [
    {
        id: 'facebook',
        title: 'Facebook',
        icon: 'facebook',
        subPackages: [
            {
                title: 'ফেসবুক বুস্ট প্যাকেজ',
                note: 'বিঃদ্রঃ আমরা ব্যাংকের কার্ড দিয়ে বুস্ট করে থাকি ।এছাড়াও আপনি আপনার ইচ্ছামত ডলার দিয়ে বুস্ট করতে পারবেন । সর্বনিম্ন ১০ ডলার থেকে শুরু । পার ডলার ১৫০ টাকা মাত্র । টার্গেট অডিয়েন্স নির্ধারণ করে বুস্ট করতে পারবেন । এরিয়া ভিত্তিক বুস্ট করতে পারবেন । হটলাইনঃ ০১৭৪৭-৯৮০৬৬২ ।',
                options: [
                    { name: '১০ দিনের জন্য ১০ ডলার', price: '১৫০০ টাকা' },
                    { name: '১৫ দিনের জন্য ১৫ ডলার', price: '২২৫০ টাকা' },
                    { name: '২০ দিনের জন্য ২০ ডলার', price: '৩০০০ টাকা' },
                    { name: '২৫ দিনের জন্য ২৫ ডলার', price: '৩৭৫০ টাকা' },
                    { name: '৩০ দিনের জন্য ৩০ ডলার', price: '৪৫০০ টাকা' },
                ]
            },
            {
                title: 'ফেসবুক ফলোয়ার প্যাকেজ',
                note: 'বিঃদ্রঃ আমরা ব্যাংকের কার্ড দিয়ে প্রমোট করে থাকি । প্রত্যেকটি লাইক ফলোয়ার পেইড এবং অর্গানিক ।আপনার পেজের লাইক ফলোয়ার এক্টিভ অ্যাকাউন্ট থেকে পড়বে । হটলাইনঃ 01747-980662 ।',
                options: [
                    { name: '২০০০ লাইক/ফলোয়ার', price: '১৫০০ টাকা' },
                    { name: '৩০০০ লাইক/ফলোয়ার', price: '২২৫০ টাকা' },
                    { name: '৪০০০ লাইক/ফলোয়ার', price: '৩০০০ টাকা' },
                    { name: '৫০০০ লাইক/ফলোয়ার', price: '৩৭৫০ টাকা' },
                    { name: '৬০০০ লাইক/ফলোয়ার', price: '৪৫০০ টাকা' },
                    { name: '৭০০০ লাইক/ফলোয়ার', price: '৫২৫০ টাকা' },
                    { name: '৮০০০ লাইক/ফলোয়ার', price: '৬০০০ টাকা' },
                    { name: '৯০০০ লাইক/ফলোয়ার', price: '৬৭৫০ টাকা' },
                    { name: '১০০০০ লাইক/ফলোয়ার', price: '৭৫০০ টাকা' },
                ]
            }
        ]
    },
    {
        id: 'instagram',
        title: 'Instagram',
        icon: 'instagram',
        subPackages: [
            {
                title: 'ইনস্টাগ্রাম বুস্ট প্যাকেজ',
                note: 'বিঃদ্রঃ আমরা ব্যাংকের কার্ড দিয়ে বুস্ট করে থাকি ।এছাড়াও আপনি আপনার ইচ্ছামত ডলার দিয়ে বুস্ট করতে পারবেন । সর্বনিম্ন ১০ ডলার থেকে শুরু । পার ডলার ১৫০ টাকা মাত্র । টার্গেট অডিয়েন্স নির্ধারণ করে বুস্ট করতে পারবেন । এরিয়া ভিত্তিক বুস্ট করতে পারবেন । হটলাইনঃ ০১৭৪৭-৯৮০৬৬২ ।',
                options: [
                    { name: '১০ দিনের জন্য ১০ ডলার', price: '১৫০০ টাকা' },
                    { name: '১৫ দিনের জন্য ১৫ ডলার', price: '২২৫০ টাকা' },
                    { name: '২০ দিনের জন্য ২০ ডলার', price: '৩০০০ টাকা' },
                    { name: '২৫ দিনের জন্য ২৫ ডলার', price: '৩৭৫০ টাকা' },
                    { name: '৩০ দিনের জন্য ৩০ ডলার', price: '৪৫০০ টাকা' },
                ]
            },
            {
                title: 'ইনস্টাগ্রাম ফলোয়ার প্যাকেজ',
                note: 'বিঃদ্রঃ আমরা ব্যাংকের কার্ড দিয়ে প্রমোট করে থাকি । প্রত্যেকটি ফলোয়ার পেইড এবং অর্গানিক ।আপনার ইনস্টাগ্রাম পেজের ফলোয়ার এক্টিভ অ্যাকাউন্ট থেকে পড়বে । হটলাইনঃ 01747-980662 ।',
                options: [
                    { name: '২০০০ ফলোয়ার', price: '১৫০০ টাকা' },
                    { name: '৩০০০ ফলোয়ার', price: '২২৫০ টাকা' },
                    { name: '৪০০০ ফলোয়ার', price: '৩০০০ টাকা' },
                    { name: '৫০০০ ফলোয়ার', price: '৩৭৫০ টাকা' },
                    { name: '৬০০০ ফলোয়ার', price: '৪৫০০ টাকা' },
                    { name: '৭০০০ ফলোয়ার', price: '৫২৫০ টাকা' },
                    { name: '৮০০০ ফলোয়ার', price: '৬০০০ টাকা' },
                    { name: '৯০০০ ফলোয়ার', price: '৬৭৫০ টাকা' },
                    { name: '১০০০০ ফলোয়ার', price: '৭৫০০ টাকা' },
                ]
            }
        ]
    },
    {
        id: 'tiktok',
        title: 'TikTok',
        icon: 'tiktok',
        subPackages: [
            {
                title: 'টিকটক পোস্ট লাইক প্যাকেজ',
                note: 'টিকটক পোস্ট লাইক নিলে এর সাথে ভিউ, কমেন্ট এবং শেয়ার পাচ্ছেন একদম ফ্রিতে। বিঃদ্রঃ আমার আমাদের ব্যাংক কার্ড দিয়ে আপনাদের টিকটক আইডি প্রমোট করে ফলোয়ার দেয় । তাই প্রত্যেকটি ফলোয়ার পাবেন ১০০% রিয়েল এবং অথেন্টিক। ফলোয়ার গুলা আপনাদের আইডিতে পার্মামেন্ট থাকবে । সর্বনিম্ম ১০০০ ফলোয়ার নিতে পারবেন ।',
                options: [
                    { name: '১০০০ লাইক', price: '৩০০ টাকা' },
                    { name: '২০০০ লাইক', price: '৬০০ টাকা' },
                    { name: '৩০০০ লাইক', price: '৯০০ টাকা' },
                    { name: '৪০০০ লাইক', price: '১২০০ টাকা' },
                    { name: '৫০০০ লাইক', price: '১৫০০ টাকা' },
                    { name: '১০০০০ লাইক', price: '৩০০০ টাকা' },
                ]
            },
            {
                title: 'টিকটক ফলোয়ার প্যাকেজ',
                note: 'টিকটক ফলোয়ার নিলে এর সাথে লাইক কমেন্ট ভিউ শেয়ার ফ্রি পাবেন। বিঃদ্রঃ আমার আমাদের ব্যাংক কার্ড দিয়ে আপনাদের টিকটক আইডি প্রমোট করে ফলোয়ার দেয় । তাই প্রত্যেকটি ফলোয়ার পাবেন ১০০% রিয়েল এবং অথেন্টিক। ফলোয়ার গুলা আপনাদের আইডিতে পার্মামেন্ট থাকবে । সর্বনিম্ম ১০০০ ফলোয়ার নিতে পারবেন ।',
                options: [
                    { name: '১০০০ ফলোয়ার', price: '৫০০ টাকা' },
                    { name: '২০০০ ফলোয়ার', price: '১০০০ টাকা' },
                    { name: '৩০০০ ফলোয়ার', price: '১৫০০ টাকা' },
                    { name: '৪০০০ ফলোয়ার', price: '২০০০ টাকা' },
                    { name: '৫০০০ ফলোয়ার', price: '২৫০০ টাকা' },
                    { name: '১০০০০ ফলোয়ার', price: '৫০০০ টাকা' },
                ]
            },
            {
                title: 'টিকটকে প্রোডাক্ট সেল বুস্ট প্যাকেজ',
                note: 'বিঃদ্রঃ সর্বনিম্ম ৫ ডলার করতে হবে',
                options: [
                    { name: '৫ ডলার ৪ দিনের জন্য', price: '৯০০ টাকা' },
                    { name: '১০ ডলার ৬ দিনের জন্য', price: '১৮০০ টাকা' },
                    { name: '২০ ডলার ৮ দিনের জন্য', price: '৩৬০০ টাকা' },
                    { name: '৩০ ডলার ১০ দিনের জন্য', price: '৫৪০০ টাকা' },
                ]
            },
            {
                title: 'টিকটক কয়েন রিচার্জ প্যাকেজ',
                note: 'সর্বনিম্ম ৭০ কয়েন নিতে পারবেন ।',
                options: [
                    { name: '৭০ কয়েন', price: '২০০ টাকা' },
                    { name: '৩৫০ কয়েন', price: '৮০০ টাকা' },
                    { name: '৭০০ কয়েন', price: '১৫০০ টাকা' },
                    { name: '১৪০০ কয়েন', price: '৩০০০ টাকা' },
                    { name: '৩৫০০ কয়েন', price: '৭৫০০ টাকা' },
                    { name: '৭০০০ কয়েন', price: '১৫০০০ টাকা' },
                    { name: '১৭৫০০ কয়েন', price: '৩৬০০০ টাকা' },
                ]
            },
        ]
    }
];
